Revit 2026 API

# EnergyAnalysisSurfaceType Enumeration

---

Analytical surface types.

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum EnergyAnalysisSurfaceType
```
```vb
Public Enumeration EnergyAnalysisSurfaceType
```
```cpp
public enum class EnergyAnalysisSurfaceType
```
```fsharp
type EnergyAnalysisSurfaceType
```

| Member name | Value | Description |
| --- | --- | --- |
| Air | 7 | Air. |
| Ceiling | 3 | Ceiling. |
| ExteriorFloor | 5 | Exterior floor. |
| ExteriorWall | 1 | Exterior wall. |
| InteriorFloor | 4 | Interior floor. |
| InteriorWall | 2 | Interior wall. |
| Roof | 0 | Roof. |
| Shading | 6 | Shading. |
| Underground | 8 | Underground |

#### Reference

Autodesk.Revit.DB.Analysis Namespace